#+TITLE: Test Writing: 
#+AUTHOR: Hippie Hacker
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(b) | DONE(d)
#+ARCHIVE: archive/setup.archive.org::
** DONE Grab cluster info, to ensure it is up.

  #+BEGIN_SRC shell :results silent
  kubectl cluster-info
  #+END_SRC

  #+RESULTS:
  #+begin_EXAMPLE
  Kubernetes master is running at https://127.0.0.1:37537
  KubeDNS is running at https://127.0.0.1:37537/api/v1/namespaces/kube-system/services/kube-dns:dns/proxy

  To further debug and diagnose cluster problems, use 'kubectl cluster-info dump'.
  #+end_EXAMPLE

  In the results block above you should see something like:

  : Kubernetes master is running at https://127.0.0.1:40067
  : KubeDNS is running at https://127.0.0.1:40067/api/v1/namespaces/kube-system/services/kube-dns:dns/proxy

  : To further debug and diagnose cluster problems, use 'kubectl cluster-info dump'.
** DONE Apply apisnoop
  #+begin_src shell
    kubectl apply -f https://raw.githubusercontent.com/cncf/apisnoop/master/deployment/k8s/raiinbow.yaml --namespace=kube-system
  #+end_src

  #+RESULTS:
  #+begin_EXAMPLE
  service/hasura unchanged
  service/postgres unchanged
  deployment.extensions/hasura unchanged
  deployment.extensions/postgres unchanged
  deployment.apps/apisnoop-auditlogger unchanged
  service/apisnoop-auditlogger unchanged
  auditsink.auditregistration.k8s.io/auditlogger unchanged
  #+end_EXAMPLE
  
** DONE Verify Pods Running
  !ATTENTION!: Wait for all pods to have a "Running" status before proceeding
  past this step.
  
  #+begin_src shell
  kubectl get pods --namespace=kube-system
  #+end_src

  #+RESULTS:
  #+begin_EXAMPLE
  NAME                                            READY   STATUS    RESTARTS   AGE
  apisnoop-auditlogger-5b8bd798b6-q2d82           1/1     Running   0          9m52s
  coredns-5c98db65d4-82rs6                        1/1     Running   0          21m
  coredns-5c98db65d4-wg8hk                        1/1     Running   0          21m
  etcd-kind-hh-control-plane                      1/1     Running   0          20m
  hasura-7757bf78dd-4b9gn                         1/1     Running   0          9m52s
  kindnet-xpbck                                   1/1     Running   0          21m
  kube-apiserver-kind-hh-control-plane            1/1     Running   0          20m
  kube-controller-manager-kind-hh-control-plane   1/1     Running   0          20m
  kube-proxy-sfjvj                                1/1     Running   0          21m
  kube-scheduler-kind-hh-control-plane            1/1     Running   0          20m
  postgres-5b4cc49b45-2zpw8                       1/1     Running   0          9m52s
  #+end_EXAMPLE
** Example Test

#+begin_src shell
  go get -v -u k8s.io/apimachinery/pkg/apis/meta/v1
  go get -v -u k8s.io/client-go/kubernetes
  go get -v -u k8s.io/client-go/tools/clientcmd
#+end_src

#+RESULTS:
#+begin_EXAMPLE
#+end_EXAMPLE

#+begin_src go  :imports '("fmt" "flag" "os" "k8s.io/apimachinery/pkg/apis/meta/v1" "k8s.io/client-go/kubernetes" "k8s.io/client-go/tools/clientcmd")
  // uses the current context in kubeconfig
    kubeconfig := flag.String("kubeconfig",
      fmt.Sprintf("%v/%v/%v", os.Getenv("HOME"), ".kube", "config"),
      "(optional) absolute path to the kubeconfig file")
    flag.Parse()
    config, err := clientcmd.BuildConfigFromFlags("", *kubeconfig)
    if err != nil {
      fmt.Println(err)
    }
  // make our work easier to find in the audit_event queries
  config.UserAgent = "live-test-writing"
  // creates the clientset
  clientset, _ := kubernetes.NewForConfig(config)
  // access the API to list pods
  pods, _ := clientset.CoreV1().Pods("").List(v1.ListOptions{})
  fmt.Printf("There are %d pods in the cluster\n", len(pods.Items))
#+end_src

#+RESULTS:
: There are 11 pods in the cluster


